Hi @adamconnelly 
I don't get how you get that issue 🤔 

I completely destroyed and recreated from the worker pull with a link to the IAM role, but I didn't get any errors.

If you rely on the idea that someone can provide ARN - that is interesting, but it's not valid input, it probably should failed with different error, but still.

![image](https://github.com/spacelift-io/terraform-aws-spacelift-workerpool-on-ec2/assets/11096782/cac624ba-9b2e-4fa5-bef2-65000329381d)

Deployed from https://github.com/SpotOnInc/terraform-aws-spacelift-workerpool-on-ec2/tree/a9feb348c9816dc0e608e1dc6a98e74e456e03da (includes all changes from all my 3 PRs, but they are should not interference on what you showing)

<details><summary>Here logs both for destroy and apply</summary>

```tf
 ⧉  SpotOn Inc +
 √ . [spoton-gbl-identity] (HOST) infrastructure ⨠ at destroy spacelift-worker-pool-improved-scaledown -s ue1-corp

Initializing the backend...
Initializing modules...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Reusing previous version of spacelift-io/spacelift from the dependency lock file
- Reusing previous version of hashicorp/null from the dependency lock file
- Reusing previous version of hashicorp/external from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of cloudposse/utils from the dependency lock file
- Reusing previous version of cloudposse/awsutils from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of hashicorp/archive from the dependency lock file
- Using previously-installed spacelift-io/spacelift v1.5.0
- Using previously-installed hashicorp/external v2.3.1
- Using previously-installed hashicorp/random v3.5.1
- Using previously-installed cloudposse/utils v1.12.0
- Using previously-installed hashicorp/archive v2.4.0
- Using previously-installed hashicorp/null v3.2.1
- Using previously-installed hashicorp/aws v5.22.0
- Using previously-installed cloudposse/awsutils v0.18.1
- Using previously-installed hashicorp/local v2.4.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Acquiring state lock. This may take a few moments...

No changes. No objects need to be destroyed.

Either you have not created any objects yet or the existing objects were already deleted outside of Terraform.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "aws_account_id" but a value was found in file
│ "ue1-corp-spacelift-worker-pool-improved-scaledown.terraform.tfvars.json". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations
│ in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "aws_default_region" but a value was found in file
│ "ue1-corp-spacelift-worker-pool-improved-scaledown.terraform.tfvars.json". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations
│ in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s) defined without being declared.
╵
Releasing state lock. This may take a few moments...

Destroy complete! Resources: 0 destroyed.
 ⧉  SpotOn Inc +
 √ . [spoton-gbl-identity] (HOST) infrastructure ⨠ at deploy spacelift-worker-pool-improved-scaledown -s ue1-corp

Initializing the backend...
Initializing modules...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Reusing previous version of hashicorp/null from the dependency lock file
- Reusing previous version of cloudposse/awsutils from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of hashicorp/archive from the dependency lock file
- Reusing previous version of spacelift-io/spacelift from the dependency lock file
- Reusing previous version of hashicorp/external from the dependency lock file
- Reusing previous version of cloudposse/utils from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Using previously-installed hashicorp/null v3.2.1
- Using previously-installed hashicorp/local v2.4.0
- Using previously-installed spacelift-io/spacelift v1.5.0
- Using previously-installed cloudposse/utils v1.12.0
- Using previously-installed hashicorp/random v3.5.1
- Using previously-installed cloudposse/awsutils v0.18.1
- Using previously-installed hashicorp/aws v5.22.0
- Using previously-installed hashicorp/archive v2.4.0
- Using previously-installed hashicorp/external v2.3.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Acquiring state lock. This may take a few moments...
module.ecr.data.utils_component_config.config[0]: Reading...
module.iam_roles.module.account_map.data.utils_component_config.config[0]: Reading...
module.vpc.data.utils_component_config.config[0]: Reading...
module.account_map.data.utils_component_config.config[0]: Reading...
module.ecr.data.utils_component_config.config[0]: Read complete after 4s [id=a3b58ea9d31820faa81947f5f3793d74d5951f65]
module.ecr.data.terraform_remote_state.data_source[0]: Reading...
module.iam_roles.module.account_map.data.utils_component_config.config[0]: Read complete after 4s [id=c70e2dc8a4d0da4333e5989fa0d337c5c5e5f953]
module.iam_roles.module.account_map.data.terraform_remote_state.data_source[0]: Reading...
module.vpc.data.utils_component_config.config[0]: Read complete after 4s [id=de62a5a47773ec4d68e12e83845f0680a0436912]
module.account_map.data.utils_component_config.config[0]: Read complete after 4s [id=c70e2dc8a4d0da4333e5989fa0d337c5c5e5f953]
module.vpc.data.terraform_remote_state.data_source[0]: Reading...
module.account_map.data.terraform_remote_state.data_source[0]: Reading...
module.account_map.data.terraform_remote_state.data_source[0]: Read complete after 3s
module.vpc.data.terraform_remote_state.data_source[0]: Read complete after 3s
module.iam_roles.module.account_map.data.terraform_remote_state.data_source[0]: Read complete after 4s
module.ecr.data.terraform_remote_state.data_source[0]: Read complete after 4s
module.worker_pool.module.asg.data.aws_default_tags.current: Reading...
data.aws_ssm_parameter.spacelift_key_secret: Reading...
module.worker_pool.module.asg.data.aws_partition.current: Reading...
data.aws_ssm_parameter.spacelift_key_id: Reading...
module.worker_pool.module.asg.data.aws_default_tags.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.default: Reading...
module.worker_pool.module.asg.data.aws_partition.current: Read complete after 0s [id=aws]
module.worker_pool.data.aws_ami.this: Reading...
module.worker_pool.data.aws_region.this: Reading...
data.aws_iam_policy_document.assume_role_policy: Reading...
data.aws_iam_policy_document.default: Read complete after 0s [id=837808429]
module.worker_pool.data.aws_region.this: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=2851119427]
data.aws_ssm_parameter.spacelift_key_id: Read complete after 1s [id=/spacelift/key_id]
data.aws_ssm_parameter.spacelift_key_secret: Read complete after 1s [id=/spacelift/key_secret]
module.worker_pool.data.aws_ami.this: Read complete after 1s [id=ami-09936a1b6c4e170ee]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.default will be created
  + resource "aws_iam_policy" "default" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "spoton-ue1-corp-spacelift-worker-pool-improved-scaledown"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::481513727893:role/spoton-gbl-identity-spacelift"
                    },
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-east-1:656168747096:repository/infrastructure"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 10800
      + name                  = "spoton-ue1-corp-spacelift-worker-pool-improved-scaledown"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "ue1"
          + "Name"        = "spoton-ue1-corp-spacelift-worker-pool-improved-scaledown"
          + "Namespace"   = "spoton"
          + "Stage"       = "corp"
          + "Team"        = "global"
        }
      + tags_all              = {
          + "Environment" = "ue1"
          + "Name"        = "spoton-ue1-corp-spacelift-worker-pool-improved-scaledown"
          + "Namespace"   = "spoton"
          + "Stage"       = "corp"
          + "Team"        = "global"
        }
      + unique_id             = (known after apply)
    }

  # spacelift_worker_pool.this will be created
  + resource "spacelift_worker_pool" "this" {
      + config      = (sensitive value)
      + csr         = (sensitive value)
      + description = "Deployed to us-east-1 within 'corp' AWS account"
      + id          = (known after apply)
      + name        = "Worker Pool with improved scaledown"
      + private_key = (sensitive value)
      + space_id    = "root"
    }

  # module.security_group.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "ue1"
          + "Name"        = "spoton-ue1-corp-spacelift-worker-pool-improved-scaledown"
          + "Namespace"   = "spoton"
          + "Stage"       = "corp"
          + "Team"        = "global"
        }
      + tags_all               = {
          + "Environment" = "ue1"
          + "Name"        = "spoton-ue1-corp-spacelift-worker-pool-improved-scaledown"
          + "Namespace"   = "spoton"
          + "Stage"       = "corp"
          + "Team"        = "global"
        }
      + vpc_id                 = "vpc-0e12cbbb99ea65230"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.security_group.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = jsonencode(
                {
                  + _allow_all_egress_ = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow all egress"
                      + from_port                = 0
                      + ipv6_cidr_blocks         = [
                          + "::/0",
                        ]
                      + key                      = "_allow_all_egress_"
                      + prefix_list_ids          = []
                      + protocol                 = "-1"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 0
                      + type                     = "egress"
                    }
                }
            )
        }
    }

  # module.worker_pool.data.archive_file.binary[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binary" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "ec2-workerpool-autoscaler_v0.2.0.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "lambda/bootstrap"
      + type                = "zip"
    }

  # module.worker_pool.data.aws_iam_policy_document.autoscaler[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "autoscaler" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DetachInstances",
              + "autoscaling:SetDesiredCapacity",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:TerminateInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.worker_pool.aws_cloudwatch_event_rule.scheduling[0] will be created
  + resource "aws_cloudwatch_event_rule" "scheduling" {
      + arn                 = (known after apply)
      + description         = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags_all            = (known after apply)
    }

  # module.worker_pool.aws_cloudwatch_event_target.scheduling[0] will be created
  + resource "aws_cloudwatch_event_target" "scheduling" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.worker_pool.aws_cloudwatch_log_group.log_group[0] will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.worker_pool.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "spoton-ue1-corp-spacelift-worker-pool-improved-scaledown"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.worker_pool.aws_iam_role.autoscaler[0] will be created
  + resource "aws_iam_role" "autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.worker_pool.aws_lambda_function.autoscaler[0] will be created
  + resource "aws_lambda_function" "autoscaler" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "ec2-workerpool-autoscaler_v0.2.0.zip"
      + function_name                  = (known after apply)
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.worker_pool.aws_lambda_permission.allow_cloudwatch_to_call_lambda[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.worker_pool.aws_ssm_parameter.spacelift_api_key_secret[0] will be created
  + resource "aws_ssm_parameter" "spacelift_api_key_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (known after apply)
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.worker_pool.null_resource.download[0] will be created
  + resource "null_resource" "download" {
      + id = (known after apply)
    }

  # module.worker_pool.module.asg.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = 10
      + desired_capacity                 = (known after apply)
      + enabled_metrics                  = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 30
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = [
          + "OldestLaunchTemplate",
          + "OldestInstance",
        ]
      + vpc_zone_identifier              = [
          + "subnet-04792e5a50f63e5e2",
          + "subnet-053fab02186e8ece5",
          + "subnet-071b34e58756b8abb",
        ]
      + wait_for_capacity_timeout        = "0"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
      + tag {
          + key                 = "WorkerPoolID"
          + propagate_at_launch = true
          + value               = (known after apply)
        }

      + timeouts {}
    }

  # module.worker_pool.module.asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-09936a1b6c4e170ee"
      + instance_type          = "t3.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"
          + no_device   = "0"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = (known after apply)
              + kms_key_id            = "arn:aws:kms:us-east-1:656168747096:key/5342d2c8-83c8-48d6-bfff-4da87f5b9174"
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.
module.worker_pool.null_resource.download[0]: Creating...
module.worker_pool.null_resource.download[0]: Provisioning with 'local-exec'...
module.worker_pool.null_resource.download[0] (local-exec): Executing: ["/bin/sh" "-c" ".terraform/modules/worker_pool/download.sh v0.2.0"]
module.security_group.random_id.rule_change_forces_new_security_group[0]: Creating...
module.security_group.random_id.rule_change_forces_new_security_group[0]: Creation complete after 0s [id=q37d]
module.worker_pool.null_resource.download[0] (local-exec): + code_version=v0.2.0
module.worker_pool.null_resource.download[0] (local-exec): + curl -L -o lambda.zip https://github.com/spacelift-io/ec2-workerpool-autoscaler/releases/download/v0.2.0/ec2-workerpool-autoscaler_linux_amd64.zip
module.worker_pool.null_resource.download[0] (local-exec):   % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
module.worker_pool.null_resource.download[0] (local-exec):                                  Dload  Upload   Total   Spent    Left  Speed
module.worker_pool.null_resource.download[0] (local-exec):   0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
module.worker_pool.null_resource.download[0] (local-exec):   0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
module.worker_pool.null_resource.download[0] (local-exec):   0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
module.worker_pool.null_resource.download[0] (local-exec):   3  9.7M    3  383k    0     0   252k      0  0:00:39  0:00:01  0:00:38  433k
module.worker_pool.null_resource.download[0] (local-exec):   9  9.7M    9  959k    0     0   381k      0  0:00:26  0:00:02  0:00:24  510k
aws_iam_policy.default: Creating...
module.security_group.aws_security_group.cbd[0]: Creating...
module.worker_pool.null_resource.download[0] (local-exec):  17  9.7M   17 1743k    0     0   495k      0  0:00:20  0:00:03  0:00:17  605k
spacelift_worker_pool.this: Creating...
aws_iam_policy.default: Creation complete after 1s [id=arn:aws:iam::656168747096:policy/spoton-ue1-corp-spacelift-worker-pool-improved-scaledown]
aws_iam_role.default: Creating...
module.worker_pool.null_resource.download[0] (local-exec):  25  9.7M   25 2543k    0     0   561k      0  0:00:17  0:00:04  0:00:13  653k
module.worker_pool.null_resource.download[0] (local-exec):  31  9.7M   31 3199k    0     0   578k      0  0:00:17  0:00:05  0:00:12  653k
aws_iam_role.default: Creation complete after 1s [id=spoton-ue1-corp-spacelift-worker-pool-improved-scaledown]
module.worker_pool.null_resource.download[0] (local-exec):  39  9.7M   39 3910k    0     0   599k      0  0:00:16  0:00:06  0:00:10  705k
module.security_group.aws_security_group.cbd[0]: Creation complete after 3s [id=sg-0c4733d189d176a04]
module.security_group.aws_security_group_rule.keyed["_allow_all_egress_"]: Creating...
spacelift_worker_pool.this: Creation complete after 3s [id=01HEQXTMP5ABGQ4SF9CRP77MK9]
module.worker_pool.aws_cloudwatch_event_rule.scheduling[0]: Creating...
module.worker_pool.aws_iam_instance_profile.this: Creating...
module.worker_pool.aws_ssm_parameter.spacelift_api_key_secret[0]: Creating...
module.worker_pool.aws_cloudwatch_log_group.log_group[0]: Creating...
module.security_group.aws_security_group_rule.keyed["_allow_all_egress_"]: Creation complete after 1s [id=sgrule-273993323]
module.security_group.null_resource.sync_rules_and_sg_lifecycles[0]: Creating...
module.security_group.null_resource.sync_rules_and_sg_lifecycles[0]: Creation complete after 0s [id=4165556956464194636]
module.worker_pool.null_resource.download[0] (local-exec):  45  9.7M   45 4538k    0     0   603k      0  0:00:16  0:00:07  0:00:09  715k
module.worker_pool.aws_iam_instance_profile.this: Creation complete after 1s [id=sp5ft-01HEQXTMP5ABGQ4SF9CRP77MK9]
module.worker_pool.module.asg.aws_launch_template.this[0]: Creating...
module.worker_pool.aws_cloudwatch_log_group.log_group[0]: Creation complete after 1s [id=/aws/lambda/ec2-autoscaler-01HEQXTMP5ABGQ4SF9CRP77MK9]
module.worker_pool.aws_ssm_parameter.spacelift_api_key_secret[0]: Creation complete after 2s [id=/ec2-autoscaler/spacelift-api-secret-01HEQXTMP5ABGQ4SF9CRP77MK9]
module.worker_pool.data.aws_iam_policy_document.autoscaler[0]: Reading...
module.worker_pool.data.aws_iam_policy_document.autoscaler[0]: Read complete after 0s [id=582662296]
module.worker_pool.module.asg.aws_launch_template.this[0]: Creation complete after 1s [id=lt-040e499ef7f7b2d21]
module.worker_pool.module.asg.aws_autoscaling_group.this[0]: Creating...
module.worker_pool.null_resource.download[0] (local-exec):  52  9.7M   52 5220k    0     0   613k      0  0:00:16  0:00:08  0:00:08  695k
module.worker_pool.null_resource.download[0] (local-exec):  59  9.7M   59 5980k    0     0   628k      0  0:00:15  0:00:09  0:00:06  688k
module.worker_pool.null_resource.download[0]: Still creating... [10s elapsed]
module.worker_pool.null_resource.download[0] (local-exec):  67  9.7M   67 6748k    0     0   641k      0  0:00:15  0:00:10  0:00:05  710k
module.worker_pool.null_resource.download[0] (local-exec):  73  9.7M   73 7385k    0     0   641k      0  0:00:15  0:00:11  0:00:04  695k
module.worker_pool.null_resource.download[0] (local-exec):  81  9.7M   81 8126k    0     0   648k      0  0:00:15  0:00:12  0:00:03  715k
module.worker_pool.null_resource.download[0] (local-exec):  88  9.7M   88 8843k    0     0   654k      0  0:00:15  0:00:13  0:00:02  724k
module.worker_pool.null_resource.download[0] (local-exec):  93  9.7M   93 9406k    0     0   647k      0  0:00:15  0:00:14  0:00:01  683k
module.worker_pool.null_resource.download[0] (local-exec):  99  9.7M   99 9938k    0     0   640k      0  0:00:15  0:00:15 --:--:--  638k
module.worker_pool.null_resource.download[0] (local-exec): 100  9.7M  100  9.7M    0     0   639k      0  0:00:15  0:00:15 --:--:--  636k
module.worker_pool.null_resource.download[0] (local-exec): + mkdir -p lambda
module.worker_pool.null_resource.download[0] (local-exec): + cd lambda
module.worker_pool.null_resource.download[0] (local-exec): + unzip -o ../lambda.zip
module.worker_pool.null_resource.download[0] (local-exec): Archive:  ../lambda.zip
module.worker_pool.null_resource.download[0] (local-exec):   inflating: LICENSE
module.worker_pool.null_resource.download[0] (local-exec):   inflating: README.md
module.worker_pool.null_resource.download[0] (local-exec):   inflating: bootstrap

module.worker_pool.null_resource.download[0] (local-exec): + rm ../lambda.zip
module.worker_pool.null_resource.download[0]: Creation complete after 15s [id=8649645378195242537]
module.worker_pool.data.archive_file.binary[0]: Reading...
module.worker_pool.data.archive_file.binary[0]: Read complete after 1s [id=1d7cd3fb601080410c7eb30c1fad76aead505189]
module.worker_pool.aws_cloudwatch_event_rule.scheduling[0]: Still creating... [10s elapsed]
module.worker_pool.aws_cloudwatch_event_rule.scheduling[0]: Creation complete after 11s [id=spacelift-01HEQXTMP5ABGQ4SF9CRP77MK9-scheduling]
module.worker_pool.module.asg.aws_autoscaling_group.this[0]: Still creating... [10s elapsed]
module.worker_pool.module.asg.aws_autoscaling_group.this[0]: Still creating... [20s elapsed]
module.worker_pool.module.asg.aws_autoscaling_group.this[0]: Creation complete after 23s [id=sp5ft-01HEQXTMP5ABGQ4SF9CRP77MK9-20231108165641972600000004]
module.worker_pool.aws_iam_role.autoscaler[0]: Creating...
module.worker_pool.aws_iam_role.autoscaler[0]: Creation complete after 1s [id=ec2-autoscaler-01HEQXTMP5ABGQ4SF9CRP77MK9]
module.worker_pool.aws_lambda_function.autoscaler[0]: Creating...
module.worker_pool.aws_lambda_function.autoscaler[0]: Still creating... [10s elapsed]
module.worker_pool.aws_lambda_function.autoscaler[0]: Creation complete after 16s [id=ec2-autoscaler-01HEQXTMP5ABGQ4SF9CRP77MK9]
module.worker_pool.aws_lambda_permission.allow_cloudwatch_to_call_lambda[0]: Creating...
module.worker_pool.aws_cloudwatch_event_target.scheduling[0]: Creating...
module.worker_pool.aws_cloudwatch_event_target.scheduling[0]: Creation complete after 0s [id=spacelift-01HEQXTMP5ABGQ4SF9CRP77MK9-scheduling-terraform-20231108165723616700000005]
module.worker_pool.aws_lambda_permission.allow_cloudwatch_to_call_lambda[0]: Creation complete after 0s [id=AllowExecutionFromCloudWatch]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "account_dns_environment_name" but a value was found in file
│ "ue1-corp-spacelift-worker-pool-improved-scaledown.terraform.tfvars.json". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations
│ in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "aws_account_id" but a value was found in file
│ "ue1-corp-spacelift-worker-pool-improved-scaledown.terraform.tfvars.json". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations
│ in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s) defined without being declared.
╵
Releasing state lock. This may take a few moments...

Apply complete! Resources: 18 added, 0 changed, 0 destroyed.
```

</details>

